name: "person_detection"
platform: "tensorrt_plan"
max_batch_size: 32

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 3, 560, 560 ]
  }
]

output [
  {
    name: "dets"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  },
  {
    name: "labels"
    data_type: TYPE_FP32
    dims: [ -1, 2 ]
  }
]