name: "face_alignment"
backend: "python"
max_batch_size: 0

input: [
  { 
    name: "person_image"
    data_type: TYPE_FP32
    dims: [-1, -1, -1, 3] 
  },
  { 
    name: "landmarks"
    data_type: TYPE_FP32
    dims: [-1, 5, 2] 
  },
  {
    name: "bboxes"
    data_type: TYPE_FP32
    dims: [-1, 4]
  }
]

output: [
  {
    name: "face_aligned_112"
    data_type: TYPE_FP32
    dims: [-1, 3, 112, 112] 
    }
  ,{ 
    name: "face_aligned_224"
    data_type: TYPE_FP32
    dims: [-1, 3, 224, 224] 
    }
  ,{
    name: "face_aligned_nhwc"
    data_type: TYPE_FP32
    dims: [ -1, 112, 112, 3 ]
  }
]
