name: "person_detection_preprocess"
platform: "tensorrt_plan"
max_batch_size: 32

input [
  {
    name: "raw_input"
    data_type: TYPE_UINT8
    dims: [ 3, -1, -1 ]
  }
]

output [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 3, 560, 560 ]
  },
  {
    name: "orig_shape"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]