name: "face_alignment_op"
backend: "python"
max_batch_size: 32

input: [
  { 
    name: "person_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3] 
  },
  { 
    name: "landmarks"
    data_type: TYPE_FP32
    dims: [ 5, 2] 
  },
  {
    name: "bboxes"
    data_type: TYPE_FP32
    dims: [ 4]
  }
]

output: [
  {
    name: "face_aligned_112"
    data_type: TYPE_FP32
    dims: [ 3, 112, 112] 
  },
  { 
    name: "face_aligned_224"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224] 
  },
  {
    name: "face_aligned_nhwc"
    data_type: TYPE_FP32
    dims: [ 112, 112, 3]
  }
]

instance_group [
  {
    kind: KIND_GPU
    gpus: [0]
    count: 1
  }
]