name: "pipeline_ensemble_Det"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "INPUT_IMAGE"
    # data_type: TYPE_FP32
    data_type: TYPE_UINT8
    dims: [-1, -1, -1, 3 ]
  }
]

output: [
    {
        name: "tmp_detections",
        data_type: TYPE_INT32
        dims: [1]
    },
    {
        name: "tmp_classes",
        data_type: TYPE_FP32
        dims: [-1]
    },
    {
        name: "final_boxes",
        data_type: TYPE_FP32
        dims: [-1, 4]
    },
    {
        name: "final_scores",
        data_type: TYPE_FP32
        dims: [-1]
    },
    {
        name: "final_landmarks",
        data_type: TYPE_FP32
        dims: [-1, 5, 2]
    }
]

ensemble_scheduling {
  step [
    {
      model_name: "dali_face_detection_preprocess"
      model_version: -1
      input_map { key: "raw_image", value: "INPUT_IMAGE" }
      output_map { key: "preprocessed_input", value: "tensor_for_detection" },
      output_map { key: "ratios", value: "ratio_value" }
    },
    {
      model_name: "face_detection"
      model_version: -1
      input_map { key: "input.1" value: "tensor_for_detection" }
      output_map { key: "num_detections", value: "tmp_detections" },
      output_map { key: "nmsed_boxes", value: "tmp_boxes" },
      output_map { key: "nmsed_scores", value: "tmp_scores" },
      output_map { key: "nmsed_classes", value: "tmp_classes" },
      output_map { key: "nmsed_landmarks", value: "tmp_landmarks" }
    },
    {
      model_name: "face_detection_postprocess"
      model_version: -1
      input_map { key: "tmp_boxes", value: "tmp_boxes" },
      input_map { key: "tmp_scores", value: "tmp_scores" },
      input_map { key: "tmp_landmarks", value: "tmp_landmarks" },
      input_map { key: "ratio_value", value: "ratio_value" }
      output_map { key: "final_boxes", value: "final_boxes" },
      output_map { key: "final_scores", value: "final_scores" },
      output_map { key: "final_landmarks", value: "final_landmarks" }
    }
  ]
}