name: "dali_face_detection_preprocess"
backend: "dali"
max_batch_size: 16

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8  
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "preprocessed_input"
    data_type: TYPE_FP32
    dims: [ 3, 320, 320 ]
  },
  {
    name: "ratios"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

instance_group [ { count: 1 kind: KIND_GPU } ]
