name: "face_recognition_preprocess"
backend: "dali"
max_batch_size: 32

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "preprocessed_input"
    data_type: TYPE_FP32
    dims: [ 3, 112, 112 ]
  }
]

instance_group [
  {
    name: "gpu_0"
    kind: KIND_GPU
    gpus: [ 0 ]
    count: 1
  }
]
