name: "face_recognition"
platform: "tensorrt_plan"
max_batch_size: 0
input: [
    {
        name: "data"
        data_type: TYPE_FP32
        dims: [3, 112, 112]
    }
]
output: [
    {
        name: "1333",
        data_type: TYPE_FP32
        dims: [512]
    }
]